console.log("1" + 2 + 3); //конкатенация строк
console.log(1 + 2 + "3"); //сначала происходит сложение чисел, а затем конкатенация строк
console.log("1" - 2); //произошло преобразование строкив число. знак минус заставляет js преобразовать строкув число
console.log("1" + - 2); //конкатенация строк. -2 считается числом
console.log("1" + "1" - "1"); // конкатенация строк. "1" + "1" - "1" = "11" - "1" = 10 (в последнем действии знак минус заставляет js преобразовать строку в число)
console.log("foo" + - "bar"); //
console.log(0 == "0");
console.log(0.5 + 0.1 == 0.6);
console.log(0.1 + 0.2 == 0.3);
console.log(true + true + true == 3);
console.log(true == 1);
console.log(true === 1);
console.log(1 < 2 < 3);
console.log(3 > 2 > 1);
console.log(9007199254740991 + 1 == 9007199254740991 + 2);
console.log(Math.sqrt(-1) == Math.sqrt(-1));
